index.org
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-bigblow.setup
#+TITLE: Archive of Notes (Xiaoyu Chen)

* Archive of Notes
  This repository hosts many of my notes that came from the books or the papers that I have read.
  It is mainly focus on classifying the techniques came from the books and papers.

* Sampling
** Recent Tech
*** Rapid Mixing On Matroid Bases
    - High dimential expander
    - local-to-global argument
    - [[file:Small%20Topics/rapid-mixing-on-matroid-basis/note.pdf][Notes for rapid mixing on matroid basis]]
** Tech from Book
*** Inner Product and Self-Adjoint Operator
    For reversible Markov chain, we could use spectrum decomposition to analysis its second largest eigenvalue. Here is a breif introduction about how to use technique.
    - [[file:Small%20Topics/inner-products/note.pdf][Notes on Inner Product and Self-Adjoint Operator]]
    - [[file:Small%20Topics/inner-products/lecture-adjoint-operators.pdf][Travis Schedler's note on self-adjoint operator]]

*** Eigenvalues and Mixing Time
    For reversible Markov chain, give an upper bound for its mixing time is sometimes equivalent to give an upper bound for its second largest eigenvalue. Here are some slids of mine that is focusing on this topic.
    - [[file:Small%20Topics/Eigenvalues%20and%20mixing%20time/Eigenvalues%20and%20mixing%20time.pdf][Eigenvalues and Mixing Time (Slides)]]
*** Continuous Time Markov Chain (CTMC)
    - [[file:Small%20Topics/CTMC(countinuous-time-MC)/note.pdf][construction of countinuous time Markov chain]]
    The advantage of CTMC is that the spectral gap or log-sobolev constant of it is easy to obtain by simply derivation.
** Jerrum Book
   You could access the full contents of Jerrum Book at [[http://www.maths.qmul.ac.uk/~mj/pubs.html][here]].
   The full name of this book is "Counting, sampling and integrating: algorithms and complexity"
   - Chapter 1 [ [[file:Jerrum%20Book/chapter1/exercise/exercise.pdf][exercise]] ]
   - Chapter 2 [ [[file:Jerrum%20Book/chapter2/exercise/exercise.pdf][exercise]] ]
   - Chapter 3 [ [[file:Jerrum%20Book/chapter3/exercise/exercise.pdf][exercise]] ] [ [[file:Jerrum%20Book/chapter3/note/note.pdf][note]] ]
   - Chapter 4 [ [[file:Jerrum%20Book/chapter4/exercise/exercise.pdf][exercise]] ]
   - Chapter 5 [ [[file:Jerrum%20Book/chapter5/exercise/exercise%5BC5%5D.pdf][exercise]] ] [ [[file:Jerrum%20Book/chapter5/exercise/exercise%20%5BC5%5D%20rst.pdf][exercise rest part]] ]
   - Chapter 6 [ [[file:Jerrum%20Book/chapter6/exercise/exercise%5BC6%5D.pdf][exercise]] ]
   - Chapter 7 [ [[file:Jerrum%20Book/chapter7/exercise/exercise.pdf][exercise]] ] [ [[file:Jerrum%20Book/chapter7/reference/n19.pdf][ref]] ]
   - Chapter 8 [ [[file:Jerrum%20Book/chapter8/exercise/exercise.pdf][exercise]] ] 
   - Chapter 9 [ [[file:Jerrum%20Book/chapter9/exercise/exercise%20%5BC9%5D.pdf][exercise]] ]
*** notebook for Jerrum Book
    Here is a note book for the topics appeared in Jerrum Book.
    - [[file:Jerrum%20Book/notebook/notebook.pdf][notebook]]
* MISC
** [[file:MISC/]] (Old Misc)
** [[file:Small%20Topics/point-count-problem/point-count-problem.pdf][Point Count Problem]]
