index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-17 Thu 16:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Archive of Notes (Xiaoyu Chen)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="陈小羽" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Archive of Notes (Xiaoyu Chen)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgae4e5bd">1. Archive of Notes</a></li>
<li><a href="#org376cb50">2. Sampling</a>
<ul>
<li><a href="#org4928eed">2.1. Recent Tech</a>
<ul>
<li><a href="#org18b1903">2.1.1. Rapid Mixing On Matroid Bases</a></li>
</ul>
</li>
<li><a href="#org86bcf84">2.2. Tech from Book</a>
<ul>
<li><a href="#org414a8b0">2.2.1. Inner Product and Self-Adjoint Operator</a></li>
<li><a href="#orga520883">2.2.2. Eigenvalues and Mixing Time</a></li>
<li><a href="#org4c72e07">2.2.3. Continuous Time Markov Chain (CTMC)</a></li>
</ul>
</li>
<li><a href="#org35ab6bd">2.3. Jerrum Book</a>
<ul>
<li><a href="#orgfdf5b33">2.3.1. notebook for Jerrum Book</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org42218a3">3. MISC</a>
<ul>
<li><a href="#org54acdfb">3.1. file:MISC/ (Old Misc)</a></li>
<li><a href="#org77bc3d1">3.2. Point Count Problem</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgae4e5bd" class="outline-2">
<h2 id="orgae4e5bd"><span class="section-number-2">1</span> Archive of Notes</h2>
<div class="outline-text-2" id="text-1">
<p>
This repository hosts many of my notes that came from the books or the papers that I have read.
It is mainly focus on classifying the techniques came from the books and papers.
</p>
</div>
</div>

<div id="outline-container-org376cb50" class="outline-2">
<h2 id="org376cb50"><span class="section-number-2">2</span> Sampling</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4928eed" class="outline-3">
<h3 id="org4928eed"><span class="section-number-3">2.1</span> Recent Tech</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org18b1903" class="outline-4">
<h4 id="org18b1903"><span class="section-number-4">2.1.1</span> Rapid Mixing On Matroid Bases</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>High dimential expander</li>
<li>local-to-global argument</li>
<li><a href="Small%20Topics/rapid-mixing-on-matroid-basis/note.pdf">Notes for rapid mixing on matroid basis</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org86bcf84" class="outline-3">
<h3 id="org86bcf84"><span class="section-number-3">2.2</span> Tech from Book</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org414a8b0" class="outline-4">
<h4 id="org414a8b0"><span class="section-number-4">2.2.1</span> Inner Product and Self-Adjoint Operator</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
For reversible Markov chain, we could use spectrum decomposition to analysis its second largest eigenvalue. Here is a breif introduction about how to use technique.
</p>
<ul class="org-ul">
<li><a href="Small%20Topics/inner-products/note.pdf">Notes on Inner Product and Self-Adjoint Operator</a></li>
<li><a href="Small%20Topics/inner-products/lecture-adjoint-operators.pdf">Travis Schedler's note on self-adjoint operator</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga520883" class="outline-4">
<h4 id="orga520883"><span class="section-number-4">2.2.2</span> Eigenvalues and Mixing Time</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
For reversible Markov chain, give an upper bound for its mixing time is sometimes equivalent to give an upper bound for its second largest eigenvalue. Here are some slids of mine that is focusing on this topic.
</p>
<ul class="org-ul">
<li><a href="Small%20Topics/Eigenvalues%20and%20mixing%20time/Eigenvalues%20and%20mixing%20time.pdf">Eigenvalues and Mixing Time (Slides)</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4c72e07" class="outline-4">
<h4 id="org4c72e07"><span class="section-number-4">2.2.3</span> Continuous Time Markov Chain (CTMC)</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li><a href="Small%20Topics/CTMC(countinuous-time-MC)/note.pdf">construction of countinuous time Markov chain</a></li>
</ul>
<p>
The advantage of CTMC is that the spectral gap or log-sobolev constant of it is easy to obtain by simply derivation.
</p>
</div>
</div>
</div>
<div id="outline-container-org35ab6bd" class="outline-3">
<h3 id="org35ab6bd"><span class="section-number-3">2.3</span> Jerrum Book</h3>
<div class="outline-text-3" id="text-2-3">
<p>
You could access the full contents of Jerrum Book at <a href="http://www.maths.qmul.ac.uk/~mj/pubs.html">here</a>.
The full name of this book is "Counting, sampling and integrating: algorithms and complexity"
</p>
<ul class="org-ul">
<li>Chapter 1 [ <a href="Jerrum%20Book/chapter1/exercise/exercise.pdf">exercise</a> ]</li>
<li>Chapter 2 [ <a href="Jerrum%20Book/chapter2/exercise/exercise.pdf">exercise</a> ]</li>
<li>Chapter 3 [ <a href="Jerrum%20Book/chapter3/exercise/exercise.pdf">exercise</a> ] [ <a href="Jerrum%20Book/chapter3/note/note.pdf">note</a> ]</li>
<li>Chapter 4 [ <a href="Jerrum%20Book/chapter4/exercise/exercise.pdf">exercise</a> ]</li>
<li>Chapter 5 [ <a href="Jerrum%20Book/chapter5/exercise/exercise%5BC5%5D.pdf">exercise</a> ] [ <a href="Jerrum%20Book/chapter5/exercise/exercise%20%5BC5%5D%20rst.pdf">exercise rest part</a> ]</li>
<li>Chapter 6 [ <a href="Jerrum%20Book/chapter6/exercise/exercise%5BC6%5D.pdf">exercise</a> ]</li>
<li>Chapter 7 [ <a href="Jerrum%20Book/chapter7/exercise/exercise.pdf">exercise</a> ] [ <a href="Jerrum%20Book/chapter7/reference/n19.pdf">ref</a> ]</li>
<li>Chapter 8 [ <a href="Jerrum%20Book/chapter8/exercise/exercise.pdf">exercise</a> ]</li>
<li>Chapter 9 [ <a href="Jerrum%20Book/chapter9/exercise/exercise%20%5BC9%5D.pdf">exercise</a> ]</li>
</ul>
</div>
<div id="outline-container-orgfdf5b33" class="outline-4">
<h4 id="orgfdf5b33"><span class="section-number-4">2.3.1</span> notebook for Jerrum Book</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Here is a note book for the topics appeared in Jerrum Book.
</p>
<ul class="org-ul">
<li><a href="Jerrum%20Book/notebook/notebook.pdf">notebook</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org42218a3" class="outline-2">
<h2 id="org42218a3"><span class="section-number-2">3</span> MISC</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org54acdfb" class="outline-3">
<h3 id="org54acdfb"><span class="section-number-3">3.1</span> <a href="MISC/">MISC/</a> (Old Misc)</h3>
</div>
<div id="outline-container-org77bc3d1" class="outline-3">
<h3 id="org77bc3d1"><span class="section-number-3">3.2</span> <a href="Small%20Topics/point-count-problem/point-count-problem.pdf">Point Count Problem</a></h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 陈小羽</p>
<p class="date">Created: 2020-09-17 Thu 16:41</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
